pratanczuk/qemu/tests/pic32mx350-uart-cli/main.c
/*
 * PIC32MX350F256H — minimal multi-UART console + Timer1–Timer5 delay tests.
 * Built with XC32; intended for QEMU pic32mx3-generic and real silicon.
 */
#include <stdint.h>
#include <string.h>
#include <xc.h>
#include <pic32m-libs/cp0defs.h>

/* PBCLK = SYSCLK = 80 MHz (matches QEMU default DEVCFG / OSCCON model). */
#define PBCLK_HZ        80000000u
#define UART_BAUD       115200u

#define LINE_MAX        64
#define NUM_UARTS       3
#define NUM_ADC_CH      16u

static char line[NUM_UARTS][LINE_MAX + 1];
static uint8_t pos[NUM_UARTS];

static void uart_putc(unsigned u, char c)
{
    volatile uint32_t *tx;

    switch (u) {
    case 0:
        tx = &U1TXREG;
        break;
    case 1:
        tx = &U2TXREG;
        break;
    default:
        tx = &U3TXREG;
        break;
    }
    /* Do not spin on UTXBF: under QEMU virtual time, tight TX waits can starve
     * the main loop so RX FIFO is never drained (multi-byte host input stalls). */
    *tx = (uint32_t)(unsigned char)c;
}

static void uart_puts(unsigned u, const char *s)
{
    while (*s) {
        uart_putc(u, *s++);
    }
}

static int uart_getc_ready(unsigned u)
{
    volatile uint32_t *sta = (u == 0) ? &U1STA : (u == 1) ? &U2STA : &U3STA;
    return ((*sta) & 1u) != 0; /* URXDA */
}

static int uart_getc(unsigned u)
{
    volatile uint32_t *rx = (u == 0) ? &U1RXREG : (u == 1) ? &U2RXREG : &U3RXREG;
    return (int)(*rx & 0xFFu);
}

static void uart_hw_init(unsigned u)
{
    volatile uint32_t *mode;
    volatile uint32_t *sta;
    volatile uint32_t *brg;

    switch (u) {
    case 0:
        mode = &U1MODE;
        sta = &U1STA;
        brg = &U1BRG;
        break;
    case 1:
        mode = &U2MODE;
        sta = &U2STA;
        brg = &U2BRG;
        break;
    default:
        mode = &U3MODE;
        sta = &U3STA;
        brg = &U3BRG;
        break;
    }

    *mode = 0;
    *sta = 0;
    *brg = (PBCLK_HZ / (16u * UART_BAUD)) - 1u;

    /* 8N1, BRGH=0, UART ON (bit 15). */
    *mode = 0x8000u;
    /* UTXEN bit 10, URXEN bit 12 */
    *sta = (1u << 10) | (1u << 12);
}

static void print_help(unsigned u)
{
    uart_puts(u, "Commands:\r\n"
                 "  help        - this text\r\n"
                 "  uart        - which UART this session is (1-3 on MX350)\r\n"
                 "  switch N    - verify this line is UART N (1-3); not a mux —\r\n"
                 "                U2/U3 need their own host -serial / TCP port\r\n"
                 "  timer       - Timer3 polled delay ~10 s (100 x 100 ms)\r\n"
                 "  timer_ms N  - Timer3 delay ~N ms (prescale 256)\r\n"
                 "  timmer_ms N - same as timer_ms (alias)\r\n"
                 "  timer1_ms N - Timer1 delay ~N ms (Type A, /256)\r\n"
                 "  timer2_ms N - Timer2 delay ~N ms (Type B, /256)\r\n"
                 "  timer3_ms N - Timer3 delay ~N ms (same as timer_ms)\r\n"
                 "  timer4_ms N - Timer4 delay ~N ms (Type B, /256)\r\n"
                 "  timer5_ms N - Timer5 delay ~N ms (Type B, /256)\r\n"
                 "  adc all     - sample AN0-AN15 (10-bit), one line per ch\r\n"
                 "  ocmp all    - OC1-OC5 IF with T2, then OC1 with T3\r\n"
                 "  pmp         - PMP master PMDOUT->PMDIN (QEMU XOR stub)\r\n"
                 "  misc phys   - RCON/CVR regs; IC1+CMP stubs (IC/CMP QEMU-only)\r\n"
                 "  isr flags   - IFS0/1/2 SET/CLR each irq 0-75 (IEC masked)\r\n"
                 "  isr ct      - CP0 Count/Compare -> CTIF (IFS0 bit 0)\r\n"
                 "  i2c all     - I2C1/2 TRN stub RCV+XOR + I2CxMIF (QEMU)\r\n"
                 "  nvm all     - NVM page erase + row + word on last flash page\r\n"
                 "                (QEMU mips_pic32mx3 NVM model; needs ~1 KiB scratch)\r\n"
                 "  echo X      - print X\r\n");
}

/* Max ~10 min; keeps (ms * 312500) in uint64_t with margin. */
#define TIMER_MS_MAX    600000u

static int parse_u32_dec(const char *s, uint32_t *out)
{
    uint32_t v = 0;

    while (*s == ' ' || *s == '\t') {
        s++;
    }
    if (*s < '0' || *s > '9') {
        return -1;
    }
    while (*s >= '0' && *s <= '9') {
        unsigned dig = (unsigned)(*s++ - '0');
        if (v > (0xFFFFFFFFu - dig) / 10u) {
            return -1;
        }
        v = v * 10u + dig;
    }
    while (*s == ' ' || *s == '\t') {
        s++;
    }
    if (*s != '\0') {
        return -1;
    }
    *out = v;
    return 0;
}

/*
 * Timers T1–T5: pic32mx3-generic models period match + TxIF (IFS0).
 * Type B (T2–T5): TCKPS = 111 -> /256. Type A (T1): TCKPS = 11 -> /256.
 */
#define TB_PRESCALE_256  (7u << 4)   /* Type B TCKPS */
#define T1_PRESCALE_256  (3u << 4)   /* Type A TCKPS 11 -> /256 */
#define PR3_100MS          31249u   /* 100 ms at PBCLK/256 */

static void timer3_sleep_10s(unsigned u)
{
    unsigned n;

    uart_puts(u, "Timer3: starting ~10 s (100 x 100 ms, prescale 256)...\r\n");

    T3CON = 0;
    TMR3 = 0;
    PR3 = PR3_100MS;
    IFS0CLR = _IFS0_T3IF_MASK;
    T3CON = TB_PRESCALE_256 | 0x8000u; /* TON */

    for (n = 0; n < 100u; n++) {
        while ((IFS0 & _IFS0_T3IF_MASK) == 0u) {
        }
        IFS0CLR = _IFS0_T3IF_MASK;
    }

    T3CONCLR = 0x8000u;
    uart_puts(u, "Timer3: done.\r\nOK timer\r\n");
}

static void uart_put_u32(unsigned u, uint32_t t)
{
    char buf[16];
    unsigned i = 0;

    if (t == 0u) {
        buf[i++] = '0';
    } else {
        char tmp[12];
        unsigned j = 0;

        while (t > 0u && j < sizeof tmp) {
            tmp[j++] = (char)('0' + (t % 10u));
            t /= 10u;
        }
        while (j > 0u) {
            buf[i++] = tmp[--j];
        }
    }
    buf[i] = '\0';
    uart_puts(u, buf);
}

/*
 * Arbitrary delay on timer tn (1..5): PBCLK/256 => 312500 Hz tick rate.
 * Match period = (PR+1) counts; max chunk 65536 counts per IRQ.
 */
static void timerN_sleep_ms(unsigned u, int tn, uint32_t ms, const char *err_tag,
                            const char *ok_line,
                            volatile uint32_t *tcon, volatile uint32_t *tmr,
                            volatile uint32_t *pr, uint32_t tcon_run,
                            uint32_t ifs_mask)
{
    uint64_t total;
    uint64_t rem;
    int first;

    if (ms == 0u) {
        uart_puts(u, err_tag);
        uart_puts(u, ": N must be > 0\r\n");
        return;
    }
    if (ms > TIMER_MS_MAX) {
        uart_puts(u, err_tag);
        uart_puts(u, ": N too large\r\n");
        return;
    }
    total = ((uint64_t)ms * 312500u + 999u) / 1000u;
    if (total == 0u) {
        total = 1u;
    }

    uart_puts(u, "Timer");
    uart_putc(u, (char)('0' + tn));
    uart_puts(u, ": delay ~");
    uart_put_u32(u, ms);
    uart_puts(u, " ms...\r\n");

    *tcon = 0;
    *tmr = 0;
    IFS0CLR = ifs_mask;

    rem = total;
    first = 1;
    while (rem > 0u) {
        uint32_t chunk = (rem > 65536u) ? 65536u : (uint32_t)rem;

        *pr = chunk - 1u;
        IFS0CLR = ifs_mask;
        if (first) {
            *tcon = tcon_run | 0x8000u;
            first = 0;
        }
        while ((IFS0 & ifs_mask) == 0u) {
        }
        IFS0CLR = ifs_mask;
        rem -= (uint64_t)chunk;
    }

