pratanczuk/qemu/tests/pic32mx350-uart-cli/main.c
    *tcon &= ~0x8000u; /* TON off */
    uart_puts(u, ok_line);
}

static void timer3_sleep_ms(unsigned u, uint32_t ms)
{
    timerN_sleep_ms(u, 3, ms, "ERR timer_ms", "OK timer_ms\r\n",
                    &T3CON, &TMR3, &PR3, TB_PRESCALE_256, _IFS0_T3IF_MASK);
}

static void adc_all(unsigned u)
{
    uint32_t ch;

    /*
     * Silicon: AD1CON3=0 can leave TAD out of spec so DONE never sets; set a
     * slow ADCS. Pins must be analog (ANSEL=1) + input (TRIS=1) per data sheet.
     * Boards that map UART onto AN-capable pins may need different ANSEL masks.
     */
    AD1CON1 = 0;
    AD1CON2 = 0x0000u; /* VCFG=AVdd/AVss */
    AD1CON3 = _AD1CON3_ADCS_MASK; /* ADCS=255 => long TAD at 80 MHz PBCLK */
    AD1CHS = 0;
    ANSELBSET = 0xFFFFu;
    ANSELCSET = 0xFFFFu;
    ANSELDSET = 0xFFFFu;
    ANSELESET = 0xFFFFu;
    /* Omit ANSELF/ANSELG: UART PPS often uses RF/RG; set those manually if needed. */

    AD1CON1 = _AD1CON1_ON_MASK; /* SSRC=0 manual */
    for (volatile unsigned w = 0; w < 8000u; w++) {
    }

    for (ch = 0u; ch < NUM_ADC_CH; ch++) {
        uint32_t v;
        uint32_t timeout;

        AD1CHS = (ch & 0x1Fu) << _AD1CHS_CH0SA_POSITION;
        AD1CON1SET = _AD1CON1_SAMP_MASK;
        for (volatile int i = 0; i < 200; i++) {
        }
        AD1CON1CLR = _AD1CON1_SAMP_MASK;
        timeout = 5000000u;
        while (timeout > 0u) {
            if ((AD1CON1 & _AD1CON1_DONE_MASK) != 0u) {
                break;
            }
            if ((IFS0 & _IFS0_AD1IF_MASK) != 0u) {
                break;
            }
            timeout--;
        }
        if (timeout == 0u) {
            uart_puts(u, "ERR adc all: timeout ch ");
            uart_put_u32(u, ch);
            uart_puts(u, "\r\n");
            return;
        }
        v = ADC1BUF0 & 0x3FFu;
        uart_puts(u, "ch ");
        uart_putc(u, (char)('0' + (ch / 10u) % 10u));
        uart_putc(u, (char)('0' + ch % 10u));
        uart_puts(u, " v ");
        uart_put_u32(u, v);
        uart_puts(u, "\r\n");
        AD1CON1CLR = _AD1CON1_DONE_MASK;
        IFS0CLR = _IFS0_AD1IF_MASK;
    }
    uart_puts(u, "OK adc all\r\n");
}

/* OCM != 0 enables QEMU OC IF on timer wrap; dual-compare continuous on silicon. */
#define OCMP_OCM        5U
#define OCMP_PR_SHORT   3124U /* ~10 ms tick @ PBCLK/256, same class as timer_ms */

static uint32_t ocmp_ifs_mask(int oc_num)
{
    switch (oc_num) {
    case 1:
        return _IFS0_OC1IF_MASK;
    case 2:
        return _IFS0_OC2IF_MASK;
    case 3:
        return _IFS0_OC3IF_MASK;
    case 4:
        return _IFS0_OC4IF_MASK;
    default:
        return _IFS0_OC5IF_MASK;
    }
}

static int ocmp_wait_flag(uint32_t m)
{
    uint32_t t;

    for (t = 5000000u; t > 0u; t--) {
        if ((IFS0 & m) != 0u) {
            return 0;
        }
    }
    return -1;
}

static void ocmp_all(unsigned u)
{
    int oc_num;

    /* Phase 1: OC1-OC5 use Timer2 (OCTSEL=0). */
    T2CON = 0;
    TMR2 = 0;
    PR2 = OCMP_PR_SHORT;
    OC1CON = 0;
    OC2CON = 0;
    OC3CON = 0;
    OC4CON = 0;
    OC5CON = 0;
    OC1R = 10U;
    OC1RS = 100U;
    OC2R = 10U;
    OC2RS = 100U;
    OC3R = 10U;
    OC3RS = 100U;
    OC4R = 10U;
    OC4RS = 100U;
    OC5R = 10U;
    OC5RS = 100U;
    IFS0CLR = _IFS0_T2IF_MASK | _IFS0_OC1IF_MASK | _IFS0_OC2IF_MASK
            | _IFS0_OC3IF_MASK | _IFS0_OC4IF_MASK | _IFS0_OC5IF_MASK;
    OC1CON = OCMP_OCM;
    OC2CON = OCMP_OCM;
    OC3CON = OCMP_OCM;
    OC4CON = OCMP_OCM;
    OC5CON = OCMP_OCM;
    T2CON = TB_PRESCALE_256 | 0x8000u;

    for (oc_num = 1; oc_num <= 5; oc_num++) {
        uint32_t m = ocmp_ifs_mask(oc_num);

        if (ocmp_wait_flag(m) != 0) {
            uart_puts(u, "ERR ocmp all: timeout OC");
            uart_putc(u, (char)('0' + oc_num));
            uart_puts(u, " (T2)\r\n");
            T2CONCLR = 0x8000u;
            OC1CON = 0;
            OC2CON = 0;
            OC3CON = 0;
            OC4CON = 0;
            OC5CON = 0;
            return;
        }
        IFS0CLR = m;
        IFS0CLR = _IFS0_T2IF_MASK;
        uart_puts(u, "oc ");
        uart_putc(u, (char)('0' + oc_num));
        uart_puts(u, " t2\r\n");
    }
    T2CONCLR = 0x8000u;
    OC1CON = 0;
    OC2CON = 0;
    OC3CON = 0;
    OC4CON = 0;
    OC5CON = 0;

    /* Phase 2: OC1 on Timer3 (OCTSEL=1). */
    T3CON = 0;
    TMR3 = 0;
    PR3 = OCMP_PR_SHORT;
    OC1CON = 0;
    IFS0CLR = _IFS0_T3IF_MASK | _IFS0_OC1IF_MASK;
    OC1CON = (1u << 3) | OCMP_OCM;
    T3CON = TB_PRESCALE_256 | 0x8000u;
    if (ocmp_wait_flag(_IFS0_OC1IF_MASK) != 0) {
        uart_puts(u, "ERR ocmp all: timeout OC1 (T3)\r\n");
        T3CONCLR = 0x8000u;
        OC1CON = 0;
        return;
    }
    IFS0CLR = _IFS0_OC1IF_MASK;
    IFS0CLR = _IFS0_T3IF_MASK;
    uart_puts(u, "oc 1 t3\r\n");
    T3CONCLR = 0x8000u;
    OC1CON = 0;

    uart_puts(u, "OK ocmp all\r\n");
}

/* Master mode 1 + IRQ at end of cycle; 16-bit uses XOR 0xA5A5 in QEMU PMP stub. */
#define PMP_PMM_MASTER1_16_IRQ    (0x0300u | 0x0400u | 0x2000u)
#define PMP_PMM_MASTER1_8_IRQ     (0x0300u | 0x2000u)

static int pmp_wait_ifs1(uint32_t m)
{
    uint32_t t;

    for (t = 5000000u; t > 0u; t--) {
        if ((IFS1 & m) != 0u) {
            return 0;
        }
    }
    return -1;
}

static void pmp_test(unsigned u)
{
    uint32_t d;

    PMCON = 0;
    PMMODE = 0;
    PMADDR = 0;
    PMDOUT = 0;
    PMDIN = 0;

    PMMODE = PMP_PMM_MASTER1_16_IRQ;
    PMCON = 0x8000u;
    IFS1CLR = _IFS1_PMPIF_MASK;
    PMDOUT = 0xCAFEu;
    if (pmp_wait_ifs1(_IFS1_PMPIF_MASK) != 0) {
        uart_puts(u, "ERR pmp: timeout PMPIF (16-bit)\r\n");
        PMCON = 0;
        PMMODE = 0;
        return;
    }
    IFS1CLR = _IFS1_PMPIF_MASK;
    d = PMDIN & 0xFFFFu;
    uart_puts(u, "pmp16 ");
    uart_put_u32(u, d);
    uart_puts(u, "\r\n");

    PMCON = 0;
    PMMODE = PMP_PMM_MASTER1_8_IRQ;
    PMCON = 0x8000u;
    IFS1CLR = _IFS1_PMPIF_MASK;
    PMDOUT = 0x0012u;
    if (pmp_wait_ifs1(_IFS1_PMPIF_MASK) != 0) {
        uart_puts(u, "ERR pmp: timeout PMPIF (8-bit)\r\n");
        PMCON = 0;
        PMMODE = 0;
        return;
    }
    IFS1CLR = _IFS1_PMPIF_MASK;
    d = PMDIN & 0xFFu;
    uart_puts(u, "pmp8 ");
    uart_put_u32(u, d);
    uart_puts(u, "\r\n");

    PMCON = 0;
    PMMODE = 0;
    uart_puts(u, "OK pmp\r\n");
}

static int misc_wait_ifs0(uint32_t m)
{
    uint32_t t;

