pratanczuk/qemu/tests/pic32mx350-uart-cli/main.c
    for (t = 5000000u; t > 0u; t--) {
        if ((IFS0 & m) != 0u) {
            return 0;
        }
    }
    return -1;
}

/*
 * RCON + CVRCON: register path (usable on silicon if RCON/CVR masks match).
 * IC1 + comparators: rely on QEMU stubs in mips_pic32mx3.c (instant IC1BUF, CMSTAT).
 */
static void misc_phys(unsigned u)
{
    uint32_t x;
    /* MX350: ON at bit 15, CVR<3:0> in low nibble (see __CVRCONbits_t). */
    uint32_t cvr_pat = 0x8000u | 15u;

    /* RCON: set/clear SWR (0x40) via SET/CLR aliases. */
    RCONSET = 0x40u;
    x = RCON;
    if ((x & 0x40u) == 0u) {
        uart_puts(u, "ERR misc phys: RCON SWR not set\r\n");
        return;
    }
    RCONCLR = 0x40u;
    x = RCON;
    if ((x & 0x40u) != 0u) {
        uart_puts(u, "ERR misc phys: RCON SWR not clear\r\n");
        return;
    }
    uart_puts(u, "rcon ok\r\n");

    CVRCON = 0;
    CVRCON = cvr_pat;
    x = CVRCON & 0xFFFFu;
    uart_puts(u, "cvr ");
    uart_put_u32(u, x);
    uart_puts(u, "\r\n");

    /* IC1: ICM=1 every edge, Timer2 source, ON — QEMU latches TMR2 into IC1BUF + IC1IF. */
    T2CON = 0;
    TMR2 = 0x55AAu;
    IC1CON = 0;
    IFS0CLR = _IFS0_IC1IF_MASK;
    IC1CON = 0x8000u | 1u; /* ON | ICM simple capture mode */
    if (misc_wait_ifs0(_IFS0_IC1IF_MASK) != 0) {
        uart_puts(u, "ERR misc phys: timeout IC1IF\r\n");
        IC1CON = 0;
        return;
    }
    IFS0CLR = _IFS0_IC1IF_MASK;
    x = IC1BUF & 0xFFFFu;
    uart_puts(u, "ic1 ");
    uart_put_u32(u, x);
    uart_puts(u, "\r\n");
    IC1CON = 0;

    /* Comparators: ON sets CxOUT in CMSTAT + CMPxIF (IFS1 bits 0/1) in QEMU. */
    CM1CON = 0;
    CM2CON = 0;
    IFS1CLR = _IFS1_CMP1IF_MASK | _IFS1_CMP2IF_MASK;
    CM1CON = 0x8000u;
    if (pmp_wait_ifs1(_IFS1_CMP1IF_MASK) != 0) {
        uart_puts(u, "ERR misc phys: timeout CMP1IF\r\n");
        CM1CON = 0;
        CM2CON = 0;
        return;
    }
    IFS1CLR = _IFS1_CMP1IF_MASK;
    x = CMSTAT & 3u;
    uart_puts(u, "cm ");
    uart_put_u32(u, x);
    uart_puts(u, " ");
    CM2CON = 0x8000u;
    if (pmp_wait_ifs1(_IFS1_CMP2IF_MASK) != 0) {
        uart_puts(u, "ERR misc phys: timeout CMP2IF\r\n");
        CM1CON = 0;
        CM2CON = 0;
        return;
    }
    IFS1CLR = _IFS1_CMP2IF_MASK;
    x = CMSTAT & 3u;
    uart_put_u32(u, x);
    uart_puts(u, "\r\n");
    CM1CON = 0;
    CM2CON = 0;

    uart_puts(u, "OK misc phys\r\n");
}

/* Matches mips_pic32mx3.c irq_to_vector[] length (IFS0+IFS1+MX350 IFS2 subset). */
#define PIC32MX350_N_IRQ  76u

static int ifs_bit_probe(volatile uint32_t *ifs, volatile uint32_t *ifsclr,
                         volatile uint32_t *ifsset, uint32_t bit)
{
    uint32_t m = 1u << bit;

    *ifsclr = m;
    if ((*ifs & m) != 0u) {
        return -1;
    }
    *ifsset = m;
    if ((*ifs & m) == 0u) {
        return -2;
    }
    *ifsclr = m;
    if ((*ifs & m) != 0u) {
        return -3;
    }
    return 0;
}

/*
 * Exercise every interrupt flag bit via SET/CLR aliases (IEC* = 0 so no CPU taken).
 * Silicon: reserved IFS bits may not exist; QEMU models a full 76-bit span.
 */
static void isr_flags_all(unsigned u)
{
    uint32_t save_iec0 = IEC0;
    uint32_t save_iec1 = IEC1;
    uint32_t save_iec2 = IEC2;
    uint32_t irq;

    IEC0 = 0;
    IEC1 = 0;
    IEC2 = 0;

    for (irq = 0u; irq < PIC32MX350_N_IRQ; irq++) {
        uint32_t bi = irq & 31u;
        int e;

        if (irq < 32u) {
            e = ifs_bit_probe(&IFS0, &IFS0CLR, &IFS0SET, bi);
        } else if (irq < 64u) {
            e = ifs_bit_probe(&IFS1, &IFS1CLR, &IFS1SET, bi);
        } else {
            e = ifs_bit_probe(&IFS2, &IFS2CLR, &IFS2SET, bi);
        }
        if (e != 0) {
            uart_puts(u, "ERR isr flags irq ");
            uart_put_u32(u, irq);
            uart_puts(u, "\r\n");
            goto restore_iec;
        }
    }
    uart_puts(u, "OK isr flags\r\n");

restore_iec:
    IEC0 = save_iec0;
    IEC1 = save_iec1;
    IEC2 = save_iec2;
}

/* Core timer: CP0 Compare match raises CTIF via QEMU cputimer + pic32_timer_irq. */
static void isr_ct(unsigned u)
{
    uint32_t c;
    uint32_t tmo;

    IFS0CLR = _IFS0_CTIF_MASK;
    c = _CP0_GET_COUNT();
    _CP0_SET_COMPARE(c + 200000u);
    for (tmo = 5000000u; tmo > 0u; tmo--) {
        if ((IFS0 & _IFS0_CTIF_MASK) != 0u) {
            break;
        }
    }
    IFS0CLR = _IFS0_CTIF_MASK;
    c = _CP0_GET_COUNT();
    _CP0_SET_COMPARE(c + 0x7FFFFFFFu);
    if (tmo == 0u) {
        uart_puts(u, "ERR isr ct: timeout CTIF\r\n");
        return;
    }
    uart_puts(u, "OK isr ct\r\n");
}

/* I2C: QEMU latches TRN^xor into RCV and sets I2CxMIF when I2CxCON ON. */
static void i2c_all(unsigned u)
{
    uint32_t v;

    I2C1CON = 0;
    I2C2CON = 0;
    IFS1CLR = _IFS1_I2C1MIF_MASK | _IFS1_I2C2MIF_MASK;

    I2C1CON = 0x8000u;
    I2C1TRN = 0x34u;
    if (pmp_wait_ifs1(_IFS1_I2C1MIF_MASK) != 0) {
        uart_puts(u, "ERR i2c all: timeout I2C1MIF\r\n");
        I2C1CON = 0;
        return;
    }
    IFS1CLR = _IFS1_I2C1MIF_MASK;
    v = I2C1RCV & 0xFFu;
    uart_puts(u, "i2c1 ");
    uart_put_u32(u, v);
    uart_puts(u, "\r\n");
    I2C1CON = 0;

    I2C2CON = 0x8000u;
    I2C2TRN = 0x34u;
    if (pmp_wait_ifs1(_IFS1_I2C2MIF_MASK) != 0) {
        uart_puts(u, "ERR i2c all: timeout I2C2MIF\r\n");
        I2C2CON = 0;
        return;
    }
    IFS1CLR = _IFS1_I2C2MIF_MASK;
    v = I2C2RCV & 0xFFu;
    uart_puts(u, "i2c2 ");
    uart_put_u32(u, v);
    uart_puts(u, "\r\n");
    I2C2CON = 0;

    uart_puts(u, "OK i2c all\r\n");
}

/*
 * NVM tests — PIC32MX NVMCON sequence (matches QEMU pic32mx3_nvm.c).
 * NVMCON_* / NVMOP values come from xc.h (ppic32mx.h).
 * Uses the last 1 KiB program page (0x1D03FC00); uart-cli.hex does not occupy it.
 */
#define NVMOP_WORD          NVMCON_NVMOP0                     /* word program */
#define NVMOP_ROW           (NVMCON_NVMOP0 | NVMCON_NVMOP1)   /* row program */
#define NVMOP_PAGE_ERASE    NVMCON_NVMOP2                     /* page erase */

/* Last page in 256 KiB program flash (1 KiB page, 512 B row). */
#define NVM_TEST_PHYS_PAGE  0x1D03FC00u

static uint8_t nvm_row_src[512] __attribute__((aligned(4)));

