pratanczuk/qemu/tests/pic32mx350-uart-cli/main.c
static void nvm_wrerr_clear(void)
{
    if (NVMCON & NVMCON_WRERR) {
        NVMCONCLR = NVMCON_WRERR;
    }
}

static int nvm_wait_done(unsigned u, const char *where)
{
    while ((NVMCON & NVMCON_WR) != 0u) {
    }
    if ((NVMCON & NVMCON_WRERR) != 0u) {
        uart_puts(u, where);
        uart_puts(u, ": WRERR\r\n");
        return -1;
    }
    return 0;
}

static int nvm_page_erase(unsigned u, uint32_t page_pa)
{
    nvm_wrerr_clear();
    /* Datasheet order: NVMCON (WREN|OP), NVMADDR, NVMKEY, WR */
    NVMCON = NVMCON_WREN | NVMOP_PAGE_ERASE;
    __asm__ volatile ("" ::: "memory");
    NVMADDR = page_pa;
    __asm__ volatile ("" ::: "memory");
    NVMKEY = 0xAA996655u;
    NVMKEY = 0x556699AAu;
    NVMCONSET = NVMCON_WR;
    return nvm_wait_done(u, "ERR nvm page_erase");
}

static int nvm_row_program(unsigned u, uint32_t row_pa, const void *src)
{
    nvm_wrerr_clear();
    NVMCON = NVMCON_WREN | NVMOP_ROW;
    __asm__ volatile ("" ::: "memory");
    NVMADDR = row_pa;
    __asm__ volatile ("" ::: "memory");
    NVMSRCADDR = (uint32_t)(uintptr_t)src;
    __asm__ volatile ("" ::: "memory");
    NVMKEY = 0xAA996655u;
    NVMKEY = 0x556699AAu;
    NVMCONSET = NVMCON_WR;
    return nvm_wait_done(u, "ERR nvm row");
}

static int nvm_word_program(unsigned u, uint32_t word_pa, uint32_t data)
{
    nvm_wrerr_clear();
    NVMCON = NVMCON_WREN | NVMOP_WORD;
    /* Barriers: XC32 may reorder SFR stores; NVM hardware is order-sensitive. */
    __asm__ volatile ("" ::: "memory");
    NVMADDR = word_pa;
    __asm__ volatile ("" ::: "memory");
    NVMDATA = data;
    __asm__ volatile ("" ::: "memory");
    NVMKEY = 0xAA996655u;
    NVMKEY = 0x556699AAu;
    NVMCONSET = NVMCON_WR;
    return nvm_wait_done(u, "ERR nvm word");
}

static void nvm_all(unsigned u)
{
    unsigned i;

    uart_puts(u, "nvm: test page ");
    uart_put_u32(u, NVM_TEST_PHYS_PAGE);
    uart_puts(u, "\r\n");

    if (nvm_page_erase(u, NVM_TEST_PHYS_PAGE) != 0) {
        uart_puts(u, "ERR nvm all: page_erase\r\n");
        return;
    }
    uart_puts(u, "nvm: page_erase ok\r\n");

    for (i = 0; i < sizeof nvm_row_src; i++) {
        nvm_row_src[i] = 0x5Au;
    }
    if (nvm_row_program(u, NVM_TEST_PHYS_PAGE, nvm_row_src) != 0) {
        uart_puts(u, "ERR nvm all: row\r\n");
        return;
    }
    uart_puts(u, "nvm: row ok\r\n");

    if (nvm_word_program(u, NVM_TEST_PHYS_PAGE + 512u + 16u, 0xDEADBEEFu) != 0) {
        uart_puts(u, "ERR nvm all: word\r\n");
        return;
    }
    uart_puts(u, "nvm: word ok\r\n");

    /*
     * We do not read flash back here: under QEMU the guest data path may not
     * yet see NVM-programmed words the same as silicon; WRERR/WR are enough
     * to validate pic32mx3_nvm.c + NVMKEY/NVMCON sequence.
     */
    uart_puts(u, "OK nvm all\r\n");
}

static void run_cmd(unsigned u, char *cmd)
{
    while (*cmd == ' ' || *cmd == '\t') {
        cmd++;
    }
    if (cmd[0] == '\0') {
        return;
    }
    if (strcmp(cmd, "help") == 0) {
        print_help(u);
        uart_puts(u, "OK help\r\n");
    } else if (strcmp(cmd, "uart") == 0) {
        uart_puts(u, "OK uart ");
        uart_putc(u, (char)('1' + (int)u));
        uart_puts(u, "\r\n");
    } else if (strncmp(cmd, "switch ", 7) == 0) {
        uint32_t n;

        if (parse_u32_dec(cmd + 7, &n) != 0) {
            uart_puts(u, "ERR switch: need integer N (1-3)\r\n");
        } else if (n < 1u || n > (uint32_t)NUM_UARTS) {
            uart_puts(u, "ERR switch: N must be 1-3 (MX350)\r\n");
        } else if ((unsigned)(n - 1u) != u) {
            uart_puts(u, "ERR switch: this is UART ");
            uart_putc(u, (char)('1' + (int)u));
            uart_puts(u, ", not ");
            uart_put_u32(u, n);
            uart_puts(u, "; open that UART on another host serial\r\n");
        } else {
            uart_puts(u, "OK switch ");
            uart_put_u32(u, n);
            uart_puts(u, "\r\n");
        }
    } else if (strcmp(cmd, "timer") == 0) {
        timer3_sleep_10s(u);
    } else if (strncmp(cmd, "timer_ms ", 9) == 0) {
        uint32_t ms;
        if (parse_u32_dec(cmd + 9, &ms) != 0) {
            uart_puts(u, "ERR timer_ms: need integer N\r\n");
        } else {
            timer3_sleep_ms(u, ms);
        }
    } else if (strncmp(cmd, "timmer_ms ", 10) == 0) {
        uint32_t ms;
        if (parse_u32_dec(cmd + 10, &ms) != 0) {
            uart_puts(u, "ERR timmer_ms: need integer N\r\n");
        } else {
            timer3_sleep_ms(u, ms);
        }
    } else if (strncmp(cmd, "timer", 5) == 0 && cmd[5] >= '1' && cmd[5] <= '5'
               && strncmp(cmd + 6, "_ms ", 4) == 0) {
        int tn = cmd[5] - '0';
        uint32_t ms;

        if (parse_u32_dec(cmd + 10, &ms) != 0) {
            uart_puts(u, "ERR timerN_ms: need integer N\r\n");
        } else {
            switch (tn) {
            case 1:
                timerN_sleep_ms(u, 1, ms, "ERR timer1_ms", "OK timer1_ms\r\n",
                                &T1CON, &TMR1, &PR1, T1_PRESCALE_256,
                                _IFS0_T1IF_MASK);
                break;
            case 2:
                timerN_sleep_ms(u, 2, ms, "ERR timer2_ms", "OK timer2_ms\r\n",
                                &T2CON, &TMR2, &PR2, TB_PRESCALE_256,
                                _IFS0_T2IF_MASK);
                break;
            case 3:
                timerN_sleep_ms(u, 3, ms, "ERR timer3_ms", "OK timer3_ms\r\n",
                                &T3CON, &TMR3, &PR3, TB_PRESCALE_256,
                                _IFS0_T3IF_MASK);
                break;
            case 4:
                timerN_sleep_ms(u, 4, ms, "ERR timer4_ms", "OK timer4_ms\r\n",
                                &T4CON, &TMR4, &PR4, TB_PRESCALE_256,
                                _IFS0_T4IF_MASK);
                break;
            default:
                timerN_sleep_ms(u, 5, ms, "ERR timer5_ms", "OK timer5_ms\r\n",
                                &T5CON, &TMR5, &PR5, TB_PRESCALE_256,
                                _IFS0_T5IF_MASK);
                break;
            }
        }
    } else if (strcmp(cmd, "adc all") == 0) {
        adc_all(u);
    } else if (strcmp(cmd, "ocmp all") == 0) {
        ocmp_all(u);
    } else if (strcmp(cmd, "pmp") == 0) {
        pmp_test(u);
    } else if (strcmp(cmd, "misc phys") == 0) {
        misc_phys(u);
    } else if (strcmp(cmd, "isr flags") == 0) {
        isr_flags_all(u);
    } else if (strcmp(cmd, "isr ct") == 0) {
        isr_ct(u);
    } else if (strcmp(cmd, "i2c all") == 0) {
        i2c_all(u);
    } else if (strcmp(cmd, "nvm all") == 0) {
        nvm_all(u);
    } else if (strncmp(cmd, "echo ", 5) == 0) {
        uart_puts(u, cmd + 5);
        uart_puts(u, "\r\nOK echo\r\n");
    } else {
        uart_puts(u, "Unknown. Type help\r\n");
    }
}

static void poll_uart(unsigned u)
{
    int c;

    if (!uart_getc_ready(u)) {
        return;
    }
    c = uart_getc(u);
    if (c == '\r' || c == '\n') {
        line[u][pos[u]] = '\0';
        pos[u] = 0;
        uart_puts(u, "\r\n");
        run_cmd(u, line[u]);
        uart_puts(u, "\r\nU");
        uart_putc(u, (char)('1' + (int)u));
        uart_puts(u, "> ");
        return;
    }
    if (c == 127 || c == 8) { /* backspace */
        if (pos[u] > 0) {
            pos[u]--;
            uart_puts(u, "\b \b");
        }
        return;
    }
    if (c >= 32 && c < 127 && pos[u] < LINE_MAX) {
        line[u][pos[u]++] = (char)c;
        uart_putc(u, (char)c);
    }
}

int main(void)
{
    unsigned u;

    INTCONbits.MVEC = 1;

    for (u = 0; u < NUM_UARTS; u++) {
        uart_hw_init(u);
        pos[u] = 0;
        line[u][0] = '\0';
    }

    uart_puts(0, "\r\n*** PIC32MX350 UART CLI (U1-U3; no UART4 on MX350) ***\r\n");
    /* U2/U3: same CLI; no boot spam (keeps single-host-serial logs readable). */

    print_help(0);
    uart_puts(0, "\r\nU1> ");
    uart_puts(1, "\r\nU2> ");
    uart_puts(2, "\r\nU3> ");

    for (;;) {
        poll_uart(0);
        poll_uart(1);
        poll_uart(2);
    }
}
